messages/UpdateJobHeaderRequest.txt

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <SendUpdateJobHeaderRequestMessage xmlns="http://schemas.consiliumtechnologies.com/services/mobile/2009/03/messaging">
      <SendMessageRequestInfo>
        <QueueName>\OPTIMISE\OUTPUT</QueueName>
        <Key>Debug</Key>
      </SendMessageRequestInfo>
      <UpdateJobHeaderRequest>
        <JobHeader xmlns="http://schemas.consiliumtechnologies.com/mobile/2015/05/OptimiseMessages.xsd">
          <JobIdentity xmlns="http://schemas.consiliumtechnologies.com/mobile/2015/05/OptimiseTypes.xsd">
            <Reference>%%JOBID%%</Reference>
          </JobIdentity>
          <AllocatedTo xmlns="http://schemas.consiliumtechnologies.com/mobile/2015/05/OptimiseTypes.xsd">
            <Username>%%USERNAME%%</Username>
          </AllocatedTo>
        </JobHeader>
      </UpdateJobHeaderRequest>
    </SendUpdateJobHeaderRequestMessage>
  </soap:Body>
</soap:Envelope>